Server.destroy_all
['AR 1', 'ARAB 1', 'ASIA 1', 'AU 1', 'BR 1', 'CN 1', 'DE 1', 'DE 2', 'ES 1',
 'FR 1', 'GB 1', 'GR 1', 'HANT 1', 'HIS 1', 'ID 1', 'IN 1', 'IT 1', 'JP 1',
 'KR 1', 'MX 1', 'NL 1', 'PH 1', 'PL 1', 'PT 1', 'RU 1', 'RU 2', 'TR 1',
 'US 1', 'US 2', 'INT 2', 'SKN 1'].each do |server|
  Server.create(name: server)
end

Unit.destroy_all
[['spearman', 0, 26, 26, 8, 14, 75, 2], # копейщик
 ['maceman', 0, 38, 38, 6, 32, 73, 2], # булава
 ['swordsman', 0, 61, 5, 3, 12, 24, 3], # мечник
 ['halberdier', 0, 17, 135, 45, 18, 19, 4], # алебард
 ['two-handed', 0, 109, 19, 5, 28, 18, 4], # двохручный
 ['bowman', 1, 24, 8, 24, 13, 75, 2], # лучник
 ['crossbowman', 1, 36, 6, 36, 22, 73, 2], # арбалет
 ['archer', 1, 10, 53, 55, 9, 25, 3], # универсал
 ['longbowman', 1, 20, 51, 125, 21, 21, 4], # англ.лучник
 ['heavy-crossbowman', 1, 92, 15, 24, 32, 20, 4], # тяж арбалет
 ['vet-crossbowman', 1, 98, 16, 26, 22, 23, 4], # вет.арбалет
 ['vet-maceman', 0, 118, 20, 6, 32, 22, 4], # вет.булава
 ['vet-bowman', 1, 18, 59, 132, 13, 27, 4], # вет. лучник
 ['vet-spearman', 0, 15, 142, 52, 14, 26, 4], # вет. копейщик
 ['vet-swordsman', 0, 111, 138, 72, 29, 28, 6], # мечник ветеран
 ['vet-two-handed', 0, 125, 20, 6, 32, 28, 4], # вет. двохручный
 ['vet-heavy-crossbowman', 1, 114, 16, 26, 25, 28, 4], # вет. тяж. арбалет
 ['vet-longbowman', 1, 17, 61, 134, 14, 32, 4], # вет. англ. лук
 ['vet-halberdier', 0, 15, 145, 55, 15, 32, 4], # вет. алербард
 ['traw-crossbowman', 1, 135, 22, 30, 35, 28, 4], # странник арбалет
 ['traw-knight', 0, 146, 20, 9, 34, 28, 4], # странник руки
 ['royal-knight', 0, 132, 18, 5, 33, 28, 4], # корол. руки
 ['royal-crossbowman', 1, 121, 14, 23, 29, 28, 4], # корол. луки
 ['royal-sentinel', 0, 14, 150, 59, 16, 32, 4], # корол. деф руки
 ['royal-scout', 1, 16, 64, 139, 15, 32, 4], # корол. деф луки
 ['nord-warrior', 0, 103, 129, 41, 28, 73, 4], # ренегат лед руки
 ['nord-bowman', 1, 86, 48, 116, 28, 73, 4], # ренегат лед луки
 ['wolf', 0, 50, 50, 0, 0, 80, 3], # волки
 ['barbarian', 0, 113, 9, 4, 50, 25, 4], # быстрый мародер
 ['saber-warrior', 0, 111, 137, 48, 28, 25, 4], # ренегат песок руки
 ['desert-bowman', 1, 94, 54, 126, 28, 25, 4], # ренегат песок луки
 ['flame-bearer', 0, 14, 170, 49, 3, 25, 4], # огнемет
 ['composite-bowman', 1, 16, 54, 159, 2, 25, 4], # композитный лук
 ['demon-horror', 0, 185, 119, 5, 35, 28, 5], # ужас руки
 ['deathly-horror', 1, 162, 15, 24, 40, 28, 5], # ужас луки
 ['cultist-warrior', 0, 124, 144, 55, 28, 25, 4], # ренегат вершины руки
 ['cultist-bowman', 1, 112, 59, 135, 28, 25, 4], # ренегат вершины луки
 ['skeleton-warrior', 0, 185, 19, 5, 35, 28, 5], # скелет руки
 ['skeleton-bowman', 1, 162, 15, 24, 40, 28, 5], # скелет луки
 ['slingshot', 1, 130, 5, 9, 29, 28, 4], # пращник
 ['vet-slingshot', 1, 139, 19, 24, 32, 28, 4], # вет. пращник
 ['spear-thrower', 1, 14, 20, 139, 15, 32, 4], # копьеметальщик
 ['saber', 0, 139, 6, 3, 33, 28, 4], # сабельщик
 ['vet-saber', 0, 149, 20, 15, 35, 28, 4], # вет. сабельщик
 ['khan-quards', 0, 175, 54, 50, 32, 28, 5], # ханская стража
 ['elite-knight', 0, 140, 18, 5, 33, 28, 4], # элитный руки
 ['elite-crossbowman', 1, 129, 14, 23, 29, 28, 4], # элитный луки
 ['swashbuckler', 0, 166, 11, 3, 90, 28, 6], # рубака-ренегат
 ['sail-ripper', 1, 144, 8, 14, 90, 28, 6], # потрошитель парусов ренегат
 ['shark-warrior', 0, 146, 20, 9, 0, 50, 4], # мятежный воин (острова)
 ['stone-smasher', 1, 135, 22, 30, 0, 50, 4], # мятежный камнебой (острова)
 ['pyromaniac', 0, 111, 19, 4, 25, 30, 4], # пироман
 ['vet-pyromaniac', 0, 160, 19, 4, 31, 32, 5], # ветеран-пироман
 ['marauder', 0, 113, 18, 4, 70, 30, 4], # мародер
 ['vet-marauder', 0, 165, 18, 4, 105, 32, 5], # ветеран-мародер
 ['tentacles', 0, 109, 135, 45, 20, 0, 0], # щупальца
 ['kraken', 1, 92, 51, 125, 20, 0, 0], # кракен
 ['arrow-thrower', 1, 148, 18, 27, 25, 50, 4], # самурай - стреломет
 ['sai', 0, 160, 20, 7, 29, 50, 4], # самурай - воин с сай
 ['bow-master', 1, 16, 39, 153, 15, 322, 4], # самурай - мастер лука
 ['katana', 0, 14, 165, 37, 16, 32, 4], # самурай - воин с катаной
 ['shadow-crossbowman', 1, 39, 20, 7, 22, 23, 0], # тайные луки
 # ['shadow-maceman',0,], # тайные руки
 ['dragon-claws', 0, 1, 250, 180, 1, 0, 0], # вершины когти
 ['dragon-fire', 1, 1, 400, 470, 1, 0, 0]].each do |unit| # вершины огонь
  Unit.create(name: unit[0],
              image: "#{unit[0]}.jpg",
              kind: unit[1],
              power: unit[2],
              defmelee: unit[3],
              defranged: unit[4],
              capasity: unit[5],
              speed: unit[6],
              food: unit[7])
end
